const InfoDemo = () => {
  return (
    <>
      <p className="info-demo__text">
        Демо-режим предназначен для быстрого ознакомления с&nbsp;проектом.
        В&nbsp;этом режиме намеренно ускорен игровой прогресс, чтобы
        за&nbsp;короткое время можно было увидеть весь основной функционал:
        боевую механику, систему урона и&nbsp;критов, экономику, прокачку
        и&nbsp;финального босса. В демо-режиме сразу доступен финальный босс.
      </p>
      <br />
      <p className="info-demo__text">
        Цель демо-режима&nbsp;&mdash; продемонстрировать архитектуру, логику
        и&nbsp;взаимодействие компонентов без необходимости длительного
        прохождения игры.
      </p>
    </>
  );
};

export default InfoDemo;
